TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_wadi.h
//###########################################################################
//
// FILE:    hw_wadi.h
//
// TITLE:   Definitions for the WADI registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_WADI_H
#define HW_WADI_H

//*************************************************************************************************
//
// The following are defines for the WADI register offsets
//
//*************************************************************************************************
#define WADI_O_BLKCFG             0x0U    // WADI Block Clock Divider
#define WADI_O_SIGTOSIGCFG        0x4U    // Configuration for SIG1 to SIG2 comparison for WADI
                                          // Block
#define WADI_O_SIGTOSIG_PKCFG     0x8U    // Signal1 to Signal2 peak comparison value and margin
                                          // for WADI Block
#define WADI_O_SIGTOSIG_AVGCFG    0xCU    // Signal1 to Signal2 average comparison value and margin
                                          // for WADI Block
#define WADI_O_SIGTOSIG_DBOLAPA   0x10U   // Signal1 to Signal2 dead-band comparison difference and
                                          // margin for WADI Block
#define WADI_O_SIGTOSIG_DBOLAPB   0x14U   // Signal1 to Signal2 dead-band and Overlap compare
                                          // values for WADI Block
#define WADI_O_BLKTRIGCFG         0x18U   // The trigger configuration for SIG1 and SIG2 of the
                                          // WADI Block
#define WADI_O_SIG1CFG            0x40U   // Measurement configuration for SIG1 of WADI Block
#define WADI_O_SIG1CMPA           0x44U   // Envelope-1 compare value and margin for SIG1 for WADI
                                          // Block
#define WADI_O_SIG1CMPB           0x48U   // Envelope-2 compare value and margin for SIG1 for WADI
                                          // Block
#define WADI_O_SIG1PKCFG          0x4CU   // Peak of the aggregation compare configuration for 
                                          // SIG1 of WADI Block
#define WADI_O_SIG1AVGCFG         0x50U   // Average of the aggregation comparison configuration
                                          // for SIG1 of WADI Block
#define WADI_O_SIG1EDGECFG        0x54U   // Frequency measurement  configuration for SIG1 of WADI
                                          // Block
#define WADI_O_SIG1EDGEMVWCFG     0x58U   // Moving Window Configuration for SIG1 of WADI Block
#define WADI_O_SIG2CFG            0x80U   // Measurement configuration for SIG2 of WADI Block
#define WADI_O_SIG2CMPA           0x84U   // Compare value A and +/- margin for SIG2 for WADI Block
#define WADI_O_SIG2CMPB           0x88U   // Compare value B and +/- margin for SIG2 for WADI Block
#define WADI_O_SIG2PKCFG          0x8CU   // Peak of the aggregation compare configuration for 
                                          // SIG2 of WADI Block
#define WADI_O_SIG2AVGCFG         0x90U   // Average of the aggregation comparison configuration
                                          // for SIG2 of WADI Block
#define WADI_O_SIG2EDGECFG        0x94U   // Frequency measurement  configuration for SIG2 of WADI
                                          // Block
#define WADI_O_SIG2EDGEMVWCFG     0x98U   // Moving Window Configuration for SIG2 of WADI Block
#define WADI_O_BLKERRSTS          0xC0U   // Block status register
#define WADI_O_BLKERRINFO         0xC4U   // Block count value of failed register
#define WADI_O_BLKERRCFG          0xC8U   // Block Debug additional info.
#define WADI_O_SSS_EVTMASK        0xCCU   // Mask to combine Block errors for trigger of SSS in
                                          // event word Output by WADI block
#define WADI_O_PARTEST            0xE8U   // Enables parity test

#define WADI_O_BASETIMERLOW         0x0U     // Read only value for lower word of the base timer.
#define WADI_O_BASETIMERHIGH        0x4U     // Upper word of the base timer and trigger to start
                                             // the timer.
#define WADI_O_INTSTS               0x8U     // Gives the block wise aggregated raw error status
                                             // that shall trigger the interrupt.
#define WADI_O_INTSTSMASK           0xCU     // Provides mask for application to suppress or allow
                                             // a particular block related errors to cause
                                             // interrupt or not
#define WADI_O_BLKSMASKSTS          0x10U    // This is AND combination of active high indication
                                             // of block-wise status asserting an interrupt.
#define WADI_O_INTSTSCLR            0x14U    // Provides way for application to clear the interrupt
                                             // status.
#define WADI_O_INTSTSFRC            0x18U    // Allows emulation of the RIS to raise interrupt in
                                             // software
#define WADI_O_SIGSYNCFILTCFG       0x1CU    // Each input SIG to be connected through synchroniser
                                             // or not
#define WADI_O_TRIGSYNCFILTCFG      0x20U    // Each trigger to be connected through synchroniser
                                             // or not
#define WADI_O_REVISION             0x3CU    // IP Revision
#define WADI_O_DMATRIGSTS           0x40U    // Status of the DMA triggers active
#define WADI_O_DMATRIGEN            0x44U    // Mask to enable individual trigger cause
#define WADI_O_DMASTSUPDATE         0x48U    // Indicates the register set updated post DMA write
#define WADI_O_DMAFILTWRCFG         0x4CU    // DMA writes Filter enable for each of WADI & SSS
                                             // blocks
#define WADI_O_CFGREGLOCK           0xA4U    // Configuration Register Lock
#define WADI_O_CFGREGCOMMIT         0xA8U    // Configuration Register Commit
#define WADI_O_OPERREGLOCK          0xACU    // Operating Register Lock
#define WADI_O_OPERREGCOMMIT        0xB0U    // Operating Register Commit
#define WADI_O_SSS_EVTTRIG          0xB8U    // Event trigger word output by WADI instance for SSS
#define WADI_O_SSS_OUTEVTSTS        0xBCU    // Status of the active event
#define WADI_O_SSS_BLK1_2OUTSEL     0xC0U    // Mux select word for outputs 0-3
#define WADI_O_SSS_BLK3_4OUTSEL     0xC4U    // Mux select word for outputs 4-7
#define WADI_O_SSS_OUTEVT1LINKCFG   0xE0U    // Output event1 Link configuration
#define WADI_O_SSS_OUTEVT2LINKCFG   0xE4U    // Output event2 link configuration
#define WADI_O_SSS_OUTEVT3LINKCFG   0xE8U    // Output event3 link configuration
#define WADI_O_SSS_OUTEVT4LINKCFG   0xECU    // Output event4 link configuration
#define WADI_O_SSS_OUTEVT5LINKCFG   0xF0U    // Output event5 link configuration
#define WADI_O_SSS_OUTEVT6LINKCFG   0xF4U    // Output event6 link configuration
#define WADI_O_SSS_OUTEVT7LINKCFG   0xF8U    // Output event7 link configuration
#define WADI_O_SSS_OUTEVT8LINKCFG   0xFCU    // Output event8 link configuration
#define WADI_O_SSS_EVT1CFG          0x100U   // Event1 that compares to trigger word SSS_EVTTRIG
#define WADI_O_SSS_EVT2CFG          0x104U   // Event2 that compares to trigger word SSS_EVTTRIG
#define WADI_O_SSS_EVT3CFG          0x108U   // Event3 that compares to trigger word SSS_EVTTRIG
#define WADI_O_SSS_EVT4CFG          0x10CU   // Event4 that compares to trigger word SSS_EVTTRIG
#define WADI_O_SSS_TRIGEVT1_4CFG    0x110U   // Configuration for using trigger word in specific
                                             // manner
#define WADI_O_SSS_BLKSOUTEVT1CFG   0x180U   // Output event1 to be applied for output
#define WADI_O_SSS_BLKSOUTEVT2CFG   0x184U   // Output event2 to be applied for output
#define WADI_O_SSS_BLKSOUTEVT3CFG   0x188U   // Output event3 to be applied for output
#define WADI_O_SSS_BLKSOUTEVT4CFG   0x18CU   // Output event4 to be applied for output
#define WADI_O_SSS_OUTEVT1TRIGCFG   0x190U   // Output event1 configuration for triggers, link
#define WADI_O_SSS_OUTEVT2TRIGCFG   0x194U   // Output event2 configuration for triggers, link
#define WADI_O_SSS_OUTEVT3TRIGCFG   0x198U   // Output event3 configuration for triggers, link
#define WADI_O_SSS_OUTEVT4TRIGCFG   0x19CU   // Output event4 configuration for triggers, link
#define WADI_O_SSS_OUTEVT1DUR       0x1A0U   // Output event1 configuration of delays
#define WADI_O_SSS_OUTEVT2DUR       0x1A4U   // Output event2 configuration of delays
#define WADI_O_SSS_OUTEVT3DUR       0x1A8U   // Output event3 configuration of delays
#define WADI_O_SSS_OUTEVT4DUR       0x1ACU   // Output event4 configuration of delays
#define WADI_O_SSS_EVT5CFG          0x200U   // Event5 that compares to trigger word SSS_EVTTRIG
#define WADI_O_SSS_EVT6CFG          0x204U   // Event6 that compares to trigger word SSS_EVTTRIG
#define WADI_O_SSS_EVT7CFG          0x208U   // Event7 that compares to trigger word SSS_EVTTRIG
#define WADI_O_SSS_EVT8CFG          0x20CU   // Event8 that compares to trigger word SSS_EVTTRIG
#define WADI_O_SSS_TRIGEVT5_8CFG    0x210U   // Configuration for using trigger word in specific
                                             // manner
#define WADI_O_SSS_BLKSOUTEVT5CFG   0x280U   // Output event5 to be applied for output
#define WADI_O_SSS_BLKSOUTEVT6CFG   0x284U   // Output event6 to be applied for output
#define WADI_O_SSS_BLKSOUTEVT7CFG   0x288U   // Output event7 to be applied for output
#define WADI_O_SSS_BLKSOUTEVT8CFG   0x28CU   // Output event8 to be applied for output
#define WADI_O_SSS_OUTEVT5TRIGCFG   0x290U   // Output event5 configuration for triggers, link
#define WADI_O_SSS_OUTEVT6TRIGCFG   0x294U   // Output event6 configuration for triggers, link
#define WADI_O_SSS_OUTEVT7TRIGCFG   0x298U   // Output event7 configuration for triggers, link
#define WADI_O_SSS_OUTEVT8TRIGCFG   0x29CU   // Output event8 configuration for triggers, link
#define WADI_O_SSS_OUTEVT5DUR       0x2A0U   // Output event5 configuration of delays
#define WADI_O_SSS_OUTEVT6DUR       0x2A4U   // Output event6 configuration of delays
#define WADI_O_SSS_OUTEVT7DUR       0x2A8U   // Output event7 configuration of delays
#define WADI_O_SSS_OUTEVT8DUR       0x2ACU   // Output event8 configuration of delays
#define WADI_O_PARTEST              0x2C8U   // Enables parity test


//*************************************************************************************************
//
// The following are defines for the bit fields in the BLKCFG register
//
//*************************************************************************************************
#define WADI_BLKCFG_CLKEN       0x10U         // Enables clock for WADI block
#define WADI_BLKCFG_SIG1IN_S    8U
#define WADI_BLKCFG_SIG1IN_M    0x1F00U       // Selects the input signal for the SIG1 input of
                                              // WADI block
#define WADI_BLKCFG_SIG2IN_S    16U
#define WADI_BLKCFG_SIG2IN_M    0x1F0000U     // Selects the input signal for the SIG2 input of
                                              // WADI block
#define WADI_BLKCFG_TRIG1IN_S   24U
#define WADI_BLKCFG_TRIG1IN_M   0xF000000U    // Selects trigger input signal for SIG1 analysis
#define WADI_BLKCFG_TRIG2IN_S   28U
#define WADI_BLKCFG_TRIG2IN_M   0xF0000000U   // Selects  trigger input signal for SIG2 analysis

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIGTOSIGCFG register
//
//*************************************************************************************************
#define WADI_SIGTOSIGCFG_CMP_S                0U
#define WADI_SIGTOSIGCFG_CMP_M                0xFFFFU       // Compare value for difference of
                                                            // width/sum measurement
#define WADI_SIGTOSIGCFG_CMPMARGIN_S          16U
#define WADI_SIGTOSIGCFG_CMPMARGIN_M          0xF0000U      // Margin of error for difference of
                                                            // width/sum measurement
#define WADI_SIGTOSIGCFG_SIGTOSIG_CMPEN       0x1000000U    // Enables the signal to signal compare
#define WADI_SIGTOSIGCFG_SIGTOSIG_DBCMPEN     0x4000000U    // Enables the deadband check between
                                                            // two signals
#define WADI_SIGTOSIGCFG_SIGTOSIG_OLAPCMPEN   0x8000000U    // Enables the overlap check between
                                                            // two signals
#define WADI_SIGTOSIGCFG_DBCMPTYPE            0x10000000U   // Selects the check type for deadband
                                                            // control
#define WADI_SIGTOSIGCFG_OLAPCMPTYPE          0x20000000U   // Selects the check type for overlap
                                                            // control

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIGTOSIG_PKCFG register
//
//*************************************************************************************************
#define WADI_SIGTOSIG_PKCFG_PKCMP_S         0U
#define WADI_SIGTOSIG_PKCFG_PKCMP_M         0xFFFFFFU     // Compare value for difference of peak
                                                          // measurement
#define WADI_SIGTOSIG_PKCFG_PKCMPMARGIN_S   24U
#define WADI_SIGTOSIG_PKCFG_PKCMPMARGIN_M   0xFF000000U   // Margin of error for difference of peak
                                                          // measurement

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIGTOSIG_AVGCFG register
//
//*************************************************************************************************
#define WADI_SIGTOSIG_AVGCFG_AVGCMP_S         0U
#define WADI_SIGTOSIG_AVGCFG_AVGCMP_M         0xFFFFFFU     // Compare difference for measurements
                                                            // average of both signals
#define WADI_SIGTOSIG_AVGCFG_AVGCMPMARGIN_S   24U
#define WADI_SIGTOSIG_AVGCFG_AVGCMPMARGIN_M   0xFF000000U   // Margin for difference of average of
                                                            // both signals

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIGTOSIG_DBOLAPA register
//
//*************************************************************************************************
#define WADI_SIGTOSIG_DBOLAPA_DBCMPA_S           0U
#define WADI_SIGTOSIG_DBOLAPA_DBCMPA_M           0xFFU         // Compare value for dead-band
                                                               // between both signals
#define WADI_SIGTOSIG_DBOLAPA_OLAPCMPA_S         8U
#define WADI_SIGTOSIG_DBOLAPA_OLAPCMPA_M         0xFFFF00U     // Compare value for Overlap between
                                                               // both signal levels
#define WADI_SIGTOSIG_DBOLAPA_OLAPCMPAMARGIN_S   24U
#define WADI_SIGTOSIG_DBOLAPA_OLAPCMPAMARGIN_M   0x3F000000U   // Margin of variation of overlap
                                                               // between both signals

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIGTOSIG_DBOLAPB register
//
//*************************************************************************************************
#define WADI_SIGTOSIG_DBOLAPB_DBCMPB_S           0U
#define WADI_SIGTOSIG_DBOLAPB_DBCMPB_M           0xFFU         // Compare value for dead-band
                                                               // between both signals
#define WADI_SIGTOSIG_DBOLAPB_OLAPCMPB_S         8U
#define WADI_SIGTOSIG_DBOLAPB_OLAPCMPB_M         0xFFFF00U     // Compare value for Overlap between
                                                               // both signal levels
#define WADI_SIGTOSIG_DBOLAPB_OLAPCMPBMARGIN_S   24U
#define WADI_SIGTOSIG_DBOLAPB_OLAPCMPBMARGIN_M   0x3F000000U   // Margin of variation of overlap
                                                               // between both signals

//*************************************************************************************************
//
// The following are defines for the bit fields in the BLKTRIGCFG register
//
//*************************************************************************************************
#define WADI_BLKTRIGCFG_TRIG1TYPE_S   0U
#define WADI_BLKTRIGCFG_TRIG1TYPE_M   0x7U         // The trigger type for SIG1 signal input.
#define WADI_BLKTRIGCFG_TRIG1SWEN     0x100U       // Software trigger for the SIG1
#define WADI_BLKTRIGCFG_TRIG2TYPE_S   16U
#define WADI_BLKTRIGCFG_TRIG2TYPE_M   0x70000U     // The trigger type for SIG2 signal input.
#define WADI_BLKTRIGCFG_TRIG2SWEN     0x1000000U   // Software trigger for the SIG2

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG1CFG register
//
//*************************************************************************************************
#define WADI_SIG1CFG_SIGPOL_S     0U
#define WADI_SIG1CFG_SIGPOL_M     0x3U         // Starting edge select as rise, fall or either
#define WADI_SIG1CFG_EDGESPAN_S   8U
#define WADI_SIG1CFG_EDGESPAN_M   0xF00U       // Defines span of edges of given type to measure
                                               // the width.
#define WADI_SIG1CFG_NUMAGGR_S    16U
#define WADI_SIG1CFG_NUMAGGR_M    0x70000U     // Defines number of measurements to be aggregated
#define WADI_SIG1CFG_AGGRMODE_S   24U
#define WADI_SIG1CFG_AGGRMODE_M   0x3000000U   // Whether peak or average or both measurements to
                                               // compute

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG1CMPA register
//
//*************************************************************************************************
#define WADI_SIG1CMPA_CMPA_S         0U
#define WADI_SIG1CMPA_CMPA_M         0xFFFFFFU     // Compare A value for measured count of the
                                                   // SIG1
#define WADI_SIG1CMPA_CMPAMARGIN_S   24U
#define WADI_SIG1CMPA_CMPAMARGIN_M   0xFF000000U   // +/- Margin for compare-1 around
                                                   // SIG1CMPA[CMPA]

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG1CMPB register
//
//*************************************************************************************************
#define WADI_SIG1CMPB_CMPB_S         0U
#define WADI_SIG1CMPB_CMPB_M         0xFFFFFFU     // Compare B value for measured count of the
                                                   // SIG1
#define WADI_SIG1CMPB_CMPBMARGIN_S   24U
#define WADI_SIG1CMPB_CMPBMARGIN_M   0xFF000000U   // +/- Margin for compare B around
                                                   // SIG1CMPB[CMPB]

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG1PKCFG register
//
//*************************************************************************************************
#define WADI_SIG1PKCFG_CMP_S         0U
#define WADI_SIG1PKCFG_CMP_M         0xFFFFFFU     // Compare value for peak measurements of SIG1
#define WADI_SIG1PKCFG_CMPMARGIN_S   24U
#define WADI_SIG1PKCFG_CMPMARGIN_M   0xFF000000U   // Margin of variation for peak measurements of
                                                   // SIG1

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG1AVGCFG register
//
//*************************************************************************************************
#define WADI_SIG1AVGCFG_CMP_S         0U
#define WADI_SIG1AVGCFG_CMP_M         0xFFFFFFU     // Compare value for average of measurements of
                                                    // SIG1
#define WADI_SIG1AVGCFG_CMPMARGIN_S   24U
#define WADI_SIG1AVGCFG_CMPMARGIN_M   0xFF000000U   // Margin for average of measurements of SIG1

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG1EDGECFG register
//
//*************************************************************************************************
#define WADI_SIG1EDGECFG_TIMEWNDOW_S   0U
#define WADI_SIG1EDGECFG_TIMEWNDOW_M   0xFFFFFFFU    // Time window to count edges of SIG1
#define WADI_SIG1EDGECFG_CNTEN         0x80000000U   // SIG1 Edge count mode enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG1EDGEMVWCFG register
//
//*************************************************************************************************
#define WADI_SIG1EDGEMVWCFG_MVWTIME_S   0U
#define WADI_SIG1EDGEMVWCFG_MVWTIME_M   0x3FFFFFFU    // Moving Window time
#define WADI_SIG1EDGEMVWCFG_MVWCNT_S    28U
#define WADI_SIG1EDGEMVWCFG_MVWCNT_M    0x30000000U   // Moving window count:number of MWVTIME
                                                      // windows to accumulate
#define WADI_SIG1EDGEMVWCFG_MVWEN       0x80000000U   // Moving window operation enable

