TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_wadi.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG2CFG register
//
//*************************************************************************************************
#define WADI_SIG2CFG_SIGPOL_S     0U
#define WADI_SIG2CFG_SIGPOL_M     0x3U         // Starting edge select as rise, fall or either
#define WADI_SIG2CFG_EDGESPAN_S   8U
#define WADI_SIG2CFG_EDGESPAN_M   0xF00U       // Defines span of edges of given type to measure
                                               // the width.
#define WADI_SIG2CFG_NUMAGGR_S    16U
#define WADI_SIG2CFG_NUMAGGR_M    0x70000U     // Defines number of measurements to be aggregated
#define WADI_SIG2CFG_AGGRMODE_S   24U
#define WADI_SIG2CFG_AGGRMODE_M   0x3000000U   // Whether peak or average or both measurements to
                                               // compute

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG2CMPA register
//
//*************************************************************************************************
#define WADI_SIG2CMPA_CMPA_S         0U
#define WADI_SIG2CMPA_CMPA_M         0xFFFFFFU     // Compare A value for measured count of the
                                                   // SIG2
#define WADI_SIG2CMPA_CMPAMARGIN_S   24U
#define WADI_SIG2CMPA_CMPAMARGIN_M   0xFF000000U   // +/- Margin for compare-1 around
                                                   // SIG2CMPA[CMPA]

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG2CMPB register
//
//*************************************************************************************************
#define WADI_SIG2CMPB_CMPB_S         0U
#define WADI_SIG2CMPB_CMPB_M         0xFFFFFFU     // Compare B value for measured count of the
                                                   // SIG2
#define WADI_SIG2CMPB_CMPBMARGIN_S   24U
#define WADI_SIG2CMPB_CMPBMARGIN_M   0xFF000000U   // +/- Margin for compare B around
                                                   // SIG2CMPB[CMPB]

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG2PKCFG register
//
//*************************************************************************************************
#define WADI_SIG2PKCFG_CMP_S         0U
#define WADI_SIG2PKCFG_CMP_M         0xFFFFFFU     // Compare value for peak measurements of SIG2
#define WADI_SIG2PKCFG_CMPMARGIN_S   24U
#define WADI_SIG2PKCFG_CMPMARGIN_M   0xFF000000U   // Margin of variation for peak measurements of
                                                   // SIG2

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG2AVGCFG register
//
//*************************************************************************************************
#define WADI_SIG2AVGCFG_CMP_S         0U
#define WADI_SIG2AVGCFG_CMP_M         0xFFFFFFU     // Compare value for average of measurements of
                                                    // SIG2
#define WADI_SIG2AVGCFG_CMPMARGIN_S   24U
#define WADI_SIG2AVGCFG_CMPMARGIN_M   0xFF000000U   // Margin for average of measurements of SIG2

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG2EDGECFG register
//
//*************************************************************************************************
#define WADI_SIG2EDGECFG_TIMEWNDOW_S   0U
#define WADI_SIG2EDGECFG_TIMEWNDOW_M   0xFFFFFFFU    // Time window to count edges of SIG2
#define WADI_SIG2EDGECFG_CNTEN         0x80000000U   // SIG2 Edge count mode enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIG2EDGEMVWCFG register
//
//*************************************************************************************************
#define WADI_SIG2EDGEMVWCFG_MVWTIME_S   0U
#define WADI_SIG2EDGEMVWCFG_MVWTIME_M   0x3FFFFFFU    // Moving Window time
#define WADI_SIG2EDGEMVWCFG_MVWCNT_S    28U
#define WADI_SIG2EDGEMVWCFG_MVWCNT_M    0x30000000U   // Moving window count:number of MWVTIME
                                                      // windows to accumulate
#define WADI_SIG2EDGEMVWCFG_MVWEN       0x80000000U   // Moving window operation enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the BLKERRSTS register
//
//*************************************************************************************************
#define WADI_BLKERRSTS_SIG1CMPAERR_S            0U
#define WADI_BLKERRSTS_SIG1CMPAERR_M            0x3U          // Compare A margin error for the
                                                              // SIG1 measurements
#define WADI_BLKERRSTS_SIG1PKERR_S              2U
#define WADI_BLKERRSTS_SIG1PKERR_M              0xCU          // Error of SIG1 peak measurements
#define WADI_BLKERRSTS_SIG1AVGERR_S             4U
#define WADI_BLKERRSTS_SIG1AVGERR_M             0x30U         // Average of aggregation error for
                                                              // the SIG1 measurements
#define WADI_BLKERRSTS_SIG1CMPBERR_S            6U
#define WADI_BLKERRSTS_SIG1CMPBERR_M            0xC0U         // Compare B margin error for the
                                                              // SIG1 measurements
#define WADI_BLKERRSTS_SIG2CMPAERR_S            8U
#define WADI_BLKERRSTS_SIG2CMPAERR_M            0x300U        // Compare A margin error for the
                                                              // SIG2 measurements
#define WADI_BLKERRSTS_SIG2PKERR_S              10U
#define WADI_BLKERRSTS_SIG2PKERR_M              0xC00U        // Error of SIG2 peak measurements
#define WADI_BLKERRSTS_SIG2AVGERR_S             12U
#define WADI_BLKERRSTS_SIG2AVGERR_M             0x3000U       // Average of aggregation error for
                                                              // the SIG2 measurements
#define WADI_BLKERRSTS_SIG2CMPBERR_S            14U
#define WADI_BLKERRSTS_SIG2CMPBERR_M            0xC000U       // Compare B margin error for the
                                                              // SIG2 measurements
#define WADI_BLKERRSTS_SIGTOSIG_CMPERR_S        16U
#define WADI_BLKERRSTS_SIGTOSIG_CMPERR_M        0x30000U      // Compare error for the SIGTOSIG
                                                              // measurements difference
#define WADI_BLKERRSTS_SIGTOSIG_PKERR_S         18U
#define WADI_BLKERRSTS_SIGTOSIG_PKERR_M         0xC0000U      // Error of SIGTOSIG peak
                                                              // measurements difference
#define WADI_BLKERRSTS_SIGTOSIG_AVGERR_S        20U
#define WADI_BLKERRSTS_SIGTOSIG_AVGERR_M        0x300000U     // Average error for the SIGTOSIG
                                                              // measurements difference
#define WADI_BLKERRSTS_SIGTOSIG_DBCMPAERR       0x400000U     // Deadband Compare A error for the
                                                              // SIGTOSIG measurements
#define WADI_BLKERRSTS_SIGTOSIG_DBCMPBERR       0x800000U     // Deadband Compare B Error for the
                                                              // SIGTOSIG measurements
#define WADI_BLKERRSTS_SIGTOSIG_OLAPCMPAERR_S   24U
#define WADI_BLKERRSTS_SIGTOSIG_OLAPCMPAERR_M   0x3000000U    // Overlap check Compare A error of
                                                              // SIGTOSIG measurements
#define WADI_BLKERRSTS_SIGTOSIG_OLAPCMPBERR_S   26U
#define WADI_BLKERRSTS_SIGTOSIG_OLAPCMPBERR_M   0xC000000U    // Overlap check Compare B error of
                                                              // SIGTOSIG measurements
#define WADI_BLKERRSTS_SIG_ERR                  0x40000000U   // Measurement error of unexpected
                                                              // waveform anomaly
#define WADI_BLKERRSTS_SIGTOSIG_ERR             0x80000000U   // Mismatch in number of readings
                                                              // between signals

//*************************************************************************************************
//
// The following are defines for the bit fields in the BLKERRINFO register
//
//*************************************************************************************************
#define WADI_BLKERRINFO_ERRCNT_S    0U
#define WADI_BLKERRINFO_ERRCNT_M    0x1FFFFFFU    // First failed count of SIGx multiplexed  to
                                                  // this register
#define WADI_BLKERRINFO_ERRTYPE_S   28U
#define WADI_BLKERRINFO_ERRTYPE_M   0x70000000U   // Type of error of the registered count

//*************************************************************************************************
//
// The following are defines for the bit fields in the BLKERRCFG register
//
//*************************************************************************************************
#define WADI_BLKERRCFG_ERRCNTSEL_S         0U
#define WADI_BLKERRCFG_ERRCNTSEL_M         0x3U         // Selects the count to be multiplexed for
                                                        // debug
#define WADI_BLKERRCFG_OVERIDESIG1_S       8U
#define WADI_BLKERRCFG_OVERIDESIG1_M       0xF00U       // Drives the signal correction for
                                                        // outputting the SIG1
#define WADI_BLKERRCFG_OVERIDESIG2_S       16U
#define WADI_BLKERRCFG_OVERIDESIG2_M       0xF0000U     // Drives the signal correction for
                                                        // outputting the SIG2
#define WADI_BLKERRCFG_OVERIDESIGTOSIG_S   24U
#define WADI_BLKERRCFG_OVERIDESIGTOSIG_M   0xF000000U   // Drives the correction to both signals if
                                                        // SIGTOSIG error

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVTMASK register
//
//*************************************************************************************************
#define WADI_SSS_EVTMASK_SIG1MASK_S   0U
#define WADI_SSS_EVTMASK_SIG1MASK_M   0x7FFFU    // Mask for specific WADI events to SSS event word
                                                 // or not
#define WADI_SSS_EVTMASK_SIG2MASK_S   16U
#define WADI_SSS_EVTMASK_SIG2MASK_M   0xF0000U   // Mask for specific WADI events to SSS event word
                                                 // or not

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTEST register
//
//*************************************************************************************************
#define WADI_PARTEST_TESTEN_S   0U
#define WADI_PARTEST_TESTEN_M   0xFU   // Parity test enable configuration


//*************************************************************************************************
//
// The following are defines for the bit fields in the BASETIMERHIGH register
//
//*************************************************************************************************
#define WADI_BASETIMERHIGH_HIGHWORD_S    0U
#define WADI_BASETIMERHIGH_HIGHWORD_M    0xFFFFFFFU    // Upper word of the base timer
#define WADI_BASETIMERHIGH_ENBASETIMER   0x80000000U   // Start base timer trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the INTSTS register
//
//*************************************************************************************************
#define WADI_INTSTS_BLK1INT            0x1U          // Interrupt status by ORing all WADI block
                                                     // errors
#define WADI_INTSTS_BLK2INT            0x2U          // Interrupt status by ORing all WADI block
                                                     // errors
#define WADI_INTSTS_BLK3INT            0x4U          // Interrupt status by ORing all WADI block
                                                     // errors
#define WADI_INTSTS_BLK4INT            0x8U          // Interrupt status by ORing all WADI block
                                                     // errors
#define WADI_INTSTS_SIGBLKSINT         0x40000000U   // ORed int status of measurement error for
                                                     // all WADI blocks
#define WADI_INTSTS_SIGTOSIG_BLKSINT   0x80000000U   // ORed int status of mismatch error for all
                                                     // WADI blocks

//*************************************************************************************************
//
// The following are defines for the bit fields in the INTSTSMASK register
//
//*************************************************************************************************
#define WADI_INTSTSMASK_BLKSMASK_S          0U
#define WADI_INTSTSMASK_BLKSMASK_M          0xFFFFU       // Line wise mask to propagate interrupt
                                                          // or not
#define WADI_INTSTSMASK_SIGBLKSMASK         0x40000000U   // Line wise mask to propagate interrupt
                                                          // or not
#define WADI_INTSTSMASK_SIGTOSIG_BLKSMASK   0x80000000U   // Line wise mask to propagate interrupt
                                                          // or not

//*************************************************************************************************
//
// The following are defines for the bit fields in the BLKSMASKSTS register
//
//*************************************************************************************************
#define WADI_BLKSMASKSTS_BLKSMASK_S     0U
#define WADI_BLKSMASKSTS_BLKSMASK_M     0xFFFFU       // This is AND of INTSTS and INTSTSMASK
#define WADI_BLKSMASKSTS_SIGBLKS        0x40000000U   // This is AND of INTSTS and INTSTSMASK
#define WADI_BLKSMASKSTS_SIGTOSIGBLKS   0x80000000U   // This is AND of INTSTS and INTSTSMASK

//*************************************************************************************************
//
// The following are defines for the bit fields in the INTSTSCLR register
//
//*************************************************************************************************
#define WADI_INTSTSCLR_BLK1INT            0x1U          // Clears the status of the INTSTS of Block
                                                        // 1
#define WADI_INTSTSCLR_BLK2INT            0x2U          // Clears the status of the INTSTS of Block
                                                        // 2
#define WADI_INTSTSCLR_BLK3INT            0x4U          // Clears the status of the INTSTS of Block
                                                        // 3
#define WADI_INTSTSCLR_BLK4INT            0x8U          // Clears the status of the INTSTS of Block
                                                        // 4
#define WADI_INTSTSCLR_SIGBLKSINT         0x40000000U   // Clears the status of all block's
                                                        // INTSTS[SIGBLKSINT]
#define WADI_INTSTSCLR_SIGTOSIG_BLKSINT   0x80000000U   // Clears the status of all block's
                                                        // INTSTS[SIGTOSIG_BLKSINT]

//*************************************************************************************************
//
// The following are defines for the bit fields in the INTSTSFRC register
//
//*************************************************************************************************
#define WADI_INTSTSFRC_BLK1INT            0x1U          // Allows software force of WADI Block
                                                        // interrupt
#define WADI_INTSTSFRC_BLK2INT            0x2U          // Allows software force of WADI Block
                                                        // interrupt
#define WADI_INTSTSFRC_BLK3INT            0x4U          // Allows software force of WADI Block
                                                        // interrupt
#define WADI_INTSTSFRC_BLK4INT            0x8U          // Allows software force of WADI Block
                                                        // interrupt
#define WADI_INTSTSFRC_SIGBLKSINT         0x40000000U   // Allows software force of WADI Block
                                                        // interrupt
#define WADI_INTSTSFRC_SIGTOSIG_BLKSINT   0x80000000U   // Allows software force of WADI Block
                                                        // interrupt

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIGSYNCFILTCFG register
//
//*************************************************************************************************
#define WADI_SIGSYNCFILTCFG_BLKS_SIGS_SYNCFILT_S   0U
#define WADI_SIGSYNCFILTCFG_BLKS_SIGS_SYNCFILT_M   0xFFU   // Selects SIG is synchronised and
                                                           // filtered or not

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRIGSYNCFILTCFG register
//
//*************************************************************************************************
#define WADI_TRIGSYNCFILTCFG_BLKS_TRIG_SYNCFILT_S   0U
#define WADI_TRIGSYNCFILTCFG_BLKS_TRIG_SYNCFILT_M   0xFFU   // Selects Trigger input is
                                                            // synchronised and filtered or not

//*************************************************************************************************
//
// The following are defines for the bit fields in the REVISION register
//
//*************************************************************************************************
#define WADI_REVISION_MINOR_S    0U
#define WADI_REVISION_MINOR_M    0x3FU         // Minor Revision Number
#define WADI_REVISION_CUSTOM_S   6U
#define WADI_REVISION_CUSTOM_M   0xC0U         // Custom Module Number
#define WADI_REVISION_MAJOR_S    8U
#define WADI_REVISION_MAJOR_M    0x700U        // Major Revision Number
#define WADI_REVISION_RTL_S      11U
#define WADI_REVISION_RTL_M      0xF800U       // Design Release Number
#define WADI_REVISION_FUNC_S     16U
#define WADI_REVISION_FUNC_M     0xFFF0000U    // Functional Release Number
#define WADI_REVISION_SCHEME_S   30U
#define WADI_REVISION_SCHEME_M   0xC0000000U   // Defines Scheme for Module

//*************************************************************************************************
//
// The following are defines for the bit fields in the DMATRIGSTS register
//
//*************************************************************************************************
#define WADI_DMATRIGSTS_BLK1_DMAEVT   0x1U          // Indicates the WADI Block event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_BLK2_DMAEVT   0x2U          // Indicates the WADI Block event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_BLK3_DMAEVT   0x4U          // Indicates the WADI Block event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_BLK4_DMAEVT   0x8U          // Indicates the WADI Block event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_EVT1      0x10000U      // Indicates the SSS Event event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_EVT2      0x20000U      // Indicates the SSS Event for DMA trigger
#define WADI_DMATRIGSTS_SSS_EVT3      0x40000U      // Indicates the SSS Event for DMA trigger
#define WADI_DMATRIGSTS_SSS_EVT4      0x80000U      // Indicates the SSS Event for DMA trigger
#define WADI_DMATRIGSTS_SSS_EVT5      0x100000U     // Indicates the SSS Event for DMA trigger
#define WADI_DMATRIGSTS_SSS_EVT6      0x200000U     // Indicates the SSS Event for DMA trigger
#define WADI_DMATRIGSTS_SSS_EVT7      0x400000U     // Indicates the SSS Event for DMA trigger
#define WADI_DMATRIGSTS_SSS_EVT8      0x800000U     // Indicates the SSS Event for DMA trigger
#define WADI_DMATRIGSTS_SSS_OUTEVT1   0x1000000U    // Indicates the SSS output event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_OUTEVT2   0x2000000U    // Indicates the SSS output event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_OUTEVT3   0x4000000U    // Indicates the SSS output event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_OUTEVT4   0x8000000U    // Indicates the SSS output event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_OUTEVT5   0x10000000U   // Indicates the SSS output event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_OUTEVT6   0x20000000U   // Indicates the SSS output event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_OUTEVT7   0x40000000U   // Indicates the SSS output event for DMA
                                                    // trigger
#define WADI_DMATRIGSTS_SSS_OUTEVT8   0x80000000U   // Indicates the SSS output event for DMA
                                                    // trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the DMATRIGEN register
//
//*************************************************************************************************
#define WADI_DMATRIGEN_BLKSDMAEVT_S         0U
#define WADI_DMATRIGEN_BLKSDMAEVT_M         0xFFFFU       // WADI Block event enables for DMA
                                                          // request trigger
#define WADI_DMATRIGEN_SSS_EVT1_4DMA_S      16U
#define WADI_DMATRIGEN_SSS_EVT1_4DMA_M      0xF0000U      // SSS Event word Set-1 enables for DMA
                                                          // request Trigger
#define WADI_DMATRIGEN_SSS_EVT5_8DMA_S      20U
#define WADI_DMATRIGEN_SSS_EVT5_8DMA_M      0xF00000U     // SSS Event word Set-2 enables for DMA
                                                          // request Trigger
#define WADI_DMATRIGEN_SSS_OUTEVT1_4DMA_S   24U
#define WADI_DMATRIGEN_SSS_OUTEVT1_4DMA_M   0xF000000U    // SSS output event 1 to 4 enables for
                                                          // DMA request Trigger
#define WADI_DMATRIGEN_SSS_OUTEVT5_8DMA_S   28U
#define WADI_DMATRIGEN_SSS_OUTEVT5_8DMA_M   0xF0000000U   // SSS output event 5 to 8 enables for
                                                          // DMA request Trigger

