TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_wadi.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the DMASTSUPDATE register
//
//*************************************************************************************************
#define WADI_DMASTSUPDATE_WRSTSBLK1   0x1U          // Status of DMA update for register set of
                                                    // WADI Block
#define WADI_DMASTSUPDATE_WRSTSBLK2   0x2U          // Status of DMA update for register set of
                                                    // WADI Block
#define WADI_DMASTSUPDATE_WRSTSBLK3   0x4U          // Status of DMA update for register set of
                                                    // WADI Block
#define WADI_DMASTSUPDATE_WRSTSBLK4   0x8U          // Status of DMA update for register set of
                                                    // WADI Block
#define WADI_DMASTSUPDATE_WRSTSEVT1   0x10000U      // DMA MMR write status of  SSS Event word
#define WADI_DMASTSUPDATE_WRSTSEVT2   0x20000U      // DMA MMR write status of  SSS Event word
#define WADI_DMASTSUPDATE_WRSTSEVT3   0x40000U      // DMA MMR write status of  SSS Event word
#define WADI_DMASTSUPDATE_WRSTSEVT4   0x80000U      // DMA MMR write status of  SSS Event word
#define WADI_DMASTSUPDATE_WRSTSEVT5   0x100000U     // DMA MMR write status of  SSS Event word
#define WADI_DMASTSUPDATE_WRSTSEVT6   0x200000U     // DMA MMR write status of  SSS Event word
#define WADI_DMASTSUPDATE_WRSTSEVT7   0x400000U     // DMA MMR write status of  SSS Event word
#define WADI_DMASTSUPDATE_WRSTSEVT8   0x800000U     // DMA MMR write status of  SSS Event word
#define WADI_DMASTSUPDATE_WRSTSOUT1   0x1000000U    // DMA MMR write status of  SSS OUTEVT1
#define WADI_DMASTSUPDATE_WRSTSOUT2   0x2000000U    // DMA MMR write status of  SSS OUTEVT2
#define WADI_DMASTSUPDATE_WRSTSOUT3   0x4000000U    // DMA MMR write status of  SSS OUTEVT3
#define WADI_DMASTSUPDATE_WRSTSOUT4   0x8000000U    // DMA MMR write status of  SSS OUTEVT4
#define WADI_DMASTSUPDATE_WRSTSOUT5   0x10000000U   // DMA MMR write status of  SSS OUTEVT5
#define WADI_DMASTSUPDATE_WRSTSOUT6   0x20000000U   // DMA MMR write status of  SSS OUTEVT6
#define WADI_DMASTSUPDATE_WRSTSOUT7   0x40000000U   // DMA MMR write status of  SSS OUTEVT7
#define WADI_DMASTSUPDATE_WRSTSOUT8   0x80000000U   // DMA MMR write status of  SSS OUTEVT8

//*************************************************************************************************
//
// The following are defines for the bit fields in the DMAFILTWRCFG register
//
//*************************************************************************************************
#define WADI_DMAFILTWRCFG_BLKSWREN_S        0U
#define WADI_DMAFILTWRCFG_BLKSWREN_M        0xFFFFU       // Enable for filtered DMA write for WADI
                                                          // Block
#define WADI_DMAFILTWRCFG_EVT1_4WREN_S      16U
#define WADI_DMAFILTWRCFG_EVT1_4WREN_M      0xF0000U      // Enable for filtered DMA write for SSS
                                                          // Event 1 to 4
#define WADI_DMAFILTWRCFG_EVT5_8WREN_S      20U
#define WADI_DMAFILTWRCFG_EVT5_8WREN_M      0xF00000U     // Enable for filtered DMA write for SSS
                                                          // Event 5 to 8
#define WADI_DMAFILTWRCFG_OUTEVT1_4WREN_S   24U
#define WADI_DMAFILTWRCFG_OUTEVT1_4WREN_M   0xF000000U    // Enable for filtered DMA write for SSS
                                                          // output Events 1-4
#define WADI_DMAFILTWRCFG_OUTEVT5_8WREN_S   28U
#define WADI_DMAFILTWRCFG_OUTEVT5_8WREN_M   0xF0000000U   // Enable for filtered DMA write for SSS
                                                          // output Events 5-8

//*************************************************************************************************
//
// The following are defines for the bit fields in the CFGREGLOCK register
//
//*************************************************************************************************
#define WADI_CFGREGLOCK_LOCK   0x1U   // Register Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CFGREGCOMMIT register
//
//*************************************************************************************************
#define WADI_CFGREGCOMMIT_COMMIT   0x1U   // CONFIG_REG_LOCK Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the OPERREGLOCK register
//
//*************************************************************************************************
#define WADI_OPERREGLOCK_LOCK   0x1U   // Register Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the OPERREGCOMMIT register
//
//*************************************************************************************************
#define WADI_OPERREGCOMMIT_COMMIT   0x1U   // OPER_REG_LOCK Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVTTRIG register
//
//*************************************************************************************************
#define WADI_SSS_EVTTRIG_EVTTRIG_S   0U
#define WADI_SSS_EVTTRIG_EVTTRIG_M   0xFFU   // SSS start if event trigger matches one of defined
                                             // EVT1-8

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVTSTS register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVTSTS_OUTEVT1_4_S   0U
#define WADI_SSS_OUTEVTSTS_OUTEVT1_4_M   0xFU    // Active seq word status for first set
#define WADI_SSS_OUTEVTSTS_OUTEVT5_8_S   4U
#define WADI_SSS_OUTEVTSTS_OUTEVT5_8_M   0xF0U   // Active seq word status for Second set

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLK1_2OUTSEL register
//
//*************************************************************************************************
#define WADI_SSS_BLK1_2OUTSEL_BLK1SIG1_S   0U
#define WADI_SSS_BLK1_2OUTSEL_BLK1SIG1_M   0xFFU         // Maps the  OUTEVTn associated with
                                                         // BLK0:SIG1
#define WADI_SSS_BLK1_2OUTSEL_BLK1SIG2_S   8U
#define WADI_SSS_BLK1_2OUTSEL_BLK1SIG2_M   0xFF00U       // Maps the OUTEVTn associated with
                                                         // BLK0:SIG2
#define WADI_SSS_BLK1_2OUTSEL_BLK2SIG1_S   16U
#define WADI_SSS_BLK1_2OUTSEL_BLK2SIG1_M   0xFF0000U     // Maps the OUTEVTn associated with
                                                         // BLK1:SIG1
#define WADI_SSS_BLK1_2OUTSEL_BLK2SIG2_S   24U
#define WADI_SSS_BLK1_2OUTSEL_BLK2SIG2_M   0xFF000000U   // Maps the OUTEVTn associated with
                                                         // BLK1:SIG2

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLK3_4OUTSEL register
//
//*************************************************************************************************
#define WADI_SSS_BLK3_4OUTSEL_BLK3SIG1_S   0U
#define WADI_SSS_BLK3_4OUTSEL_BLK3SIG1_M   0xFFU         // Maps the  OUTEVTn associated with
                                                         // BLK2:SIG1
#define WADI_SSS_BLK3_4OUTSEL_BLK3SIG2_S   8U
#define WADI_SSS_BLK3_4OUTSEL_BLK3SIG2_M   0xFF00U       // Maps the OUTEVTn associated with
                                                         // BLK2:SIG2
#define WADI_SSS_BLK3_4OUTSEL_BLK4SIG1_S   16U
#define WADI_SSS_BLK3_4OUTSEL_BLK4SIG1_M   0xFF0000U     // Maps the OUTEVTn associated with
                                                         // BLK3:SIG1
#define WADI_SSS_BLK3_4OUTSEL_BLK4SIG2_S   24U
#define WADI_SSS_BLK3_4OUTSEL_BLK4SIG2_M   0xFF000000U   // Maps the OUTEVTn associated with
                                                         // BLK3:SIG2

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT1LINKCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT1LINKCFG_OUTEVT1LINK_S   0U
#define WADI_SSS_OUTEVT1LINKCFG_OUTEVT1LINK_M   0xFFU   // Links output events (OUTEVTs) as per one
                                                        // hot encoding

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT2LINKCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT2LINKCFG_OUTEVT2LINK_S   0U
#define WADI_SSS_OUTEVT2LINKCFG_OUTEVT2LINK_M   0xFFU   // Links output events (OUTEVTs) as per one
                                                        // hot encoding

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT3LINKCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT3LINKCFG_OUTEVT3LINK_S   0U
#define WADI_SSS_OUTEVT3LINKCFG_OUTEVT3LINK_M   0xFFU   // Links output events (OUTEVTs) as per one
                                                        // hot encoding

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT4LINKCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT4LINKCFG_OUTEVT4LINK_S   0U
#define WADI_SSS_OUTEVT4LINKCFG_OUTEVT4LINK_M   0xFFU   // Links output events (OUTEVTs) as per one
                                                        // hot encoding

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT5LINKCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT5LINKCFG_OUTEVT5LINK_S   0U
#define WADI_SSS_OUTEVT5LINKCFG_OUTEVT5LINK_M   0xFFU   // Links output events (OUTEVTs) as per one
                                                        // hot encoding

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT6LINKCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT6LINKCFG_OUTEVT6LINK_S   0U
#define WADI_SSS_OUTEVT6LINKCFG_OUTEVT6LINK_M   0xFFU   // Links output events (OUTEVTs) as per one
                                                        // hot encoding

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT7LINKCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT7LINKCFG_OUTEVT7LINK_S   0U
#define WADI_SSS_OUTEVT7LINKCFG_OUTEVT7LINK_M   0xFFU   // Links output events (OUTEVTs) as per one
                                                        // hot encoding

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT8LINKCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT8LINKCFG_OUT8LINK_S   0U
#define WADI_SSS_OUTEVT8LINKCFG_OUT8LINK_M   0xFFU   // Links output events (OUTEVTs) as per one
                                                     // hot encoding

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVT1CFG register
//
//*************************************************************************************************
#define WADI_SSS_EVT1CFG_EVT1_S   0U
#define WADI_SSS_EVT1CFG_EVT1_M   0xFFU   // First event compare configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVT2CFG register
//
//*************************************************************************************************
#define WADI_SSS_EVT2CFG_EVT2_S   0U
#define WADI_SSS_EVT2CFG_EVT2_M   0xFFU   // Second word compare value configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVT3CFG register
//
//*************************************************************************************************
#define WADI_SSS_EVT3CFG_EVT3_S              0U
#define WADI_SSS_EVT3CFG_EVT3_M              0xFFU         // Third word compare value
                                                           // configuration
#define WADI_SSS_EVT3CFG_EVT3_BLK5_TO_16_S   8U
#define WADI_SSS_EVT3CFG_EVT3_BLK5_TO_16_M   0xFFFFFF00U   // Third word compare value
                                                           // configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVT4CFG register
//
//*************************************************************************************************
#define WADI_SSS_EVT4CFG_EVT4_S              0U
#define WADI_SSS_EVT4CFG_EVT4_M              0xFFU         // Fourth word compare value
                                                           // configuration
#define WADI_SSS_EVT4CFG_EVT4_BLK5_TO_16_S   8U
#define WADI_SSS_EVT4CFG_EVT4_BLK5_TO_16_M   0xFFFFFF00U   // Fourth word compare value
                                                           // configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_TRIGEVT1_4CFG register
//
//*************************************************************************************************
#define WADI_SSS_TRIGEVT1_4CFG_TRIG_EVT1CFG_S   0U
#define WADI_SSS_TRIGEVT1_4CFG_TRIG_EVT1CFG_M   0xFU         // Selects action associated with
                                                             // event 1
#define WADI_SSS_TRIGEVT1_4CFG_TRIG_EVT2CFG_S   8U
#define WADI_SSS_TRIGEVT1_4CFG_TRIG_EVT2CFG_M   0xF00U       // Selects action associated with
                                                             // event 2
#define WADI_SSS_TRIGEVT1_4CFG_TRIG_EVT3CFG_S   16U
#define WADI_SSS_TRIGEVT1_4CFG_TRIG_EVT3CFG_M   0xF0000U     // Selects action associated with
                                                             // event 3
#define WADI_SSS_TRIGEVT1_4CFG_TRIG_EVT4CFG_S   24U
#define WADI_SSS_TRIGEVT1_4CFG_TRIG_EVT4CFG_M   0xF000000U   // Selects action associated with
                                                             // event 4

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLKSOUTEVT1CFG register
//
//*************************************************************************************************
#define WADI_SSS_BLKSOUTEVT1CFG_OUTEVT1_S   0U
#define WADI_SSS_BLKSOUTEVT1CFG_OUTEVT1_M   0xFFU   // Output configuration on event 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLKSOUTEVT2CFG register
//
//*************************************************************************************************
#define WADI_SSS_BLKSOUTEVT2CFG_OUTEVT2_S   0U
#define WADI_SSS_BLKSOUTEVT2CFG_OUTEVT2_M   0xFFU   // Output configuration on event 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLKSOUTEVT3CFG register
//
//*************************************************************************************************
#define WADI_SSS_BLKSOUTEVT3CFG_OUTEVT3_S   0U
#define WADI_SSS_BLKSOUTEVT3CFG_OUTEVT3_M   0xFFU   // Output configuration on event 3

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLKSOUTEVT4CFG register
//
//*************************************************************************************************
#define WADI_SSS_BLKSOUTEVT4CFG_OUTEVT4_S   0U
#define WADI_SSS_BLKSOUTEVT4CFG_OUTEVT4_M   0xFFU   // Output configuration on event 4

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT1TRIGCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT1TRIGCFG_EVT1TRIG   0x1U    // Sets OUTEVT1 based on Event 1 Trigger
#define WADI_SSS_OUTEVT1TRIGCFG_EVT2TRIG   0x2U    // Sets OUTEVT1 based on Event 2 Trigger
#define WADI_SSS_OUTEVT1TRIGCFG_EVT3TRIG   0x4U    // Sets OUTEVT1 based on Event 3 Trigger
#define WADI_SSS_OUTEVT1TRIGCFG_EVT4TRIG   0x8U    // Sets OUTEVT1 based on Event 4 Trigger
#define WADI_SSS_OUTEVT1TRIGCFG_EVT5TRIG   0x10U   // Sets OUTEVT1 based on Event 5 Trigger
#define WADI_SSS_OUTEVT1TRIGCFG_EVT6TRIG   0x20U   // Sets OUTEVT1 based on Event 6 Trigger
#define WADI_SSS_OUTEVT1TRIGCFG_EVT7TRIG   0x40U   // Sets OUTEVT1 based on Event 7 Trigger
#define WADI_SSS_OUTEVT1TRIGCFG_EVT8TRIG   0x80U   // Sets OUTEVT1 based on Event 8 Trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT2TRIGCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT2TRIGCFG_EVT1TRIG   0x1U    // Sets OUTEVT2 based on Event 1 Trigger
#define WADI_SSS_OUTEVT2TRIGCFG_EVT2TRIG   0x2U    // Sets OUTEVT2 based on Event 2 Trigger
#define WADI_SSS_OUTEVT2TRIGCFG_EVT3TRIG   0x4U    // Sets OUTEVT2 based on Event 3 Trigger
#define WADI_SSS_OUTEVT2TRIGCFG_EVT4TRIG   0x8U    // Sets OUTEVT2 based on Event 4 Trigger
#define WADI_SSS_OUTEVT2TRIGCFG_EVT5TRIG   0x10U   // Sets OUTEVT2 based on Event 5 Trigger
#define WADI_SSS_OUTEVT2TRIGCFG_EVT6TRIG   0x20U   // Sets OUTEVT2 based on Event 6 Trigger
#define WADI_SSS_OUTEVT2TRIGCFG_EVT7TRIG   0x40U   // Sets OUTEVT2 based on Event 7 Trigger
#define WADI_SSS_OUTEVT2TRIGCFG_EVT8TRIG   0x80U   // Sets OUTEVT2 based on Event 8 Trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT3TRIGCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT3TRIGCFG_EVT1TRIG   0x1U    // Sets OUTEVT3 based on Event 1 Trigger
#define WADI_SSS_OUTEVT3TRIGCFG_EVT2TRIG   0x2U    // Sets OUTEVT3 based on Event 2 Trigger
#define WADI_SSS_OUTEVT3TRIGCFG_EVT3TRIG   0x4U    // Sets OUTEVT3 based on Event 3 Trigger
#define WADI_SSS_OUTEVT3TRIGCFG_EVT4TRIG   0x8U    // Sets OUTEVT3 based on Event 4 Trigger
#define WADI_SSS_OUTEVT3TRIGCFG_EVT5TRIG   0x10U   // Sets OUTEVT3 based on Event 5 Trigger
#define WADI_SSS_OUTEVT3TRIGCFG_EVT6TRIG   0x20U   // Sets OUTEVT3 based on Event 6 Trigger
#define WADI_SSS_OUTEVT3TRIGCFG_EVT7TRIG   0x40U   // Sets OUTEVT3 based on Event 7 Trigger
#define WADI_SSS_OUTEVT3TRIGCFG_EVT8TRIG   0x80U   // Sets OUTEVT3 based on Event 8 Trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT4TRIGCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT4TRIGCFG_EVT1TRIG   0x1U    // Sets OUTEVT4 based on Event 1 Trigger
#define WADI_SSS_OUTEVT4TRIGCFG_EVT2TRIG   0x2U    // Sets OUTEVT4 based on Event 2 Trigger
#define WADI_SSS_OUTEVT4TRIGCFG_EVT3TRIG   0x4U    // Sets OUTEVT4 based on Event 3 Trigger
#define WADI_SSS_OUTEVT4TRIGCFG_EVT4TRIG   0x8U    // Sets OUTEVT4 based on Event 4 Trigger
#define WADI_SSS_OUTEVT4TRIGCFG_EVT5TRIG   0x10U   // Sets OUTEVT4 based on Event 5 Trigger
#define WADI_SSS_OUTEVT4TRIGCFG_EVT6TRIG   0x20U   // Sets OUTEVT4 based on Event 6 Trigger
#define WADI_SSS_OUTEVT4TRIGCFG_EVT7TRIG   0x40U   // Sets OUTEVT4 based on Event 7 Trigger
#define WADI_SSS_OUTEVT4TRIGCFG_EVT8TRIG   0x80U   // Sets OUTEVT4 based on Event 8 Trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT1DUR register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT1DUR_TIME_S   0U
#define WADI_SSS_OUTEVT1DUR_TIME_M   0xFFFFFFU   // Duration time for application of OUTEVT1

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT2DUR register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT2DUR_TIME_S   0U
#define WADI_SSS_OUTEVT2DUR_TIME_M   0xFFFFFFU   // Duration time for application of OUTEVT2

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT3DUR register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT3DUR_TIME_S   0U
#define WADI_SSS_OUTEVT3DUR_TIME_M   0xFFFFFFU   // Duration time for application of OUTEVT3

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT4DUR register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT4DUR_TIME_S   0U
#define WADI_SSS_OUTEVT4DUR_TIME_M   0xFFFFFFU   // Duration time for application of OUTEVT4

