TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_wadi.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVT5CFG register
//
//*************************************************************************************************
#define WADI_SSS_EVT5CFG_EVT5_S              0U
#define WADI_SSS_EVT5CFG_EVT5_M              0xFFU         // Fifth word compare value
                                                           // configuration
#define WADI_SSS_EVT5CFG_EVT5_BLK5_TO_16_S   8U
#define WADI_SSS_EVT5CFG_EVT5_BLK5_TO_16_M   0xFFFFFF00U   // Fifth word compare value
                                                           // configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVT6CFG register
//
//*************************************************************************************************
#define WADI_SSS_EVT6CFG_EVT6_S              0U
#define WADI_SSS_EVT6CFG_EVT6_M              0xFFU         // Sixth word compare value
                                                           // configuration
#define WADI_SSS_EVT6CFG_EVT6_BLK5_TO_16_S   8U
#define WADI_SSS_EVT6CFG_EVT6_BLK5_TO_16_M   0xFFFFFF00U   // Sixth word compare value
                                                           // configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVT7CFG register
//
//*************************************************************************************************
#define WADI_SSS_EVT7CFG_EVT7_S              0U
#define WADI_SSS_EVT7CFG_EVT7_M              0xFFU         // Seventh word compare value
                                                           // configuration
#define WADI_SSS_EVT7CFG_EVT7_BLK5_TO_16_S   8U
#define WADI_SSS_EVT7CFG_EVT7_BLK5_TO_16_M   0xFFFFFF00U   // Seventh word compare value
                                                           // configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_EVT8CFG register
//
//*************************************************************************************************
#define WADI_SSS_EVT8CFG_EVT8_S              0U
#define WADI_SSS_EVT8CFG_EVT8_M              0xFFU         // Eighth word compare value
                                                           // configuration
#define WADI_SSS_EVT8CFG_EVT8_BLK5_TO_16_S   8U
#define WADI_SSS_EVT8CFG_EVT8_BLK5_TO_16_M   0xFFFFFF00U   // Eighth word compare value
                                                           // configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_TRIGEVT5_8CFG register
//
//*************************************************************************************************
#define WADI_SSS_TRIGEVT5_8CFG_TRIG_EVT5CFG_S   0U
#define WADI_SSS_TRIGEVT5_8CFG_TRIG_EVT5CFG_M   0xFU         // Selects action associated with
                                                             // event 5
#define WADI_SSS_TRIGEVT5_8CFG_TRIG_EVT6CFG_S   8U
#define WADI_SSS_TRIGEVT5_8CFG_TRIG_EVT6CFG_M   0xF00U       // Selects action associated with
                                                             // event 6
#define WADI_SSS_TRIGEVT5_8CFG_TRIG_EVT7CFG_S   16U
#define WADI_SSS_TRIGEVT5_8CFG_TRIG_EVT7CFG_M   0xF0000U     // Selects action associated with
                                                             // event 7
#define WADI_SSS_TRIGEVT5_8CFG_TRIG_EVT8CFG_S   24U
#define WADI_SSS_TRIGEVT5_8CFG_TRIG_EVT8CFG_M   0xF000000U   // Selects action associated with
                                                             // event 8

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLKSOUTEVT5CFG register
//
//*************************************************************************************************
#define WADI_SSS_BLKSOUTEVT5CFG_OUTEVT5_S   0U
#define WADI_SSS_BLKSOUTEVT5CFG_OUTEVT5_M   0xFFU   // Output configuration on event 5

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLKSOUTEVT6CFG register
//
//*************************************************************************************************
#define WADI_SSS_BLKSOUTEVT6CFG_OUTEVT6_S   0U
#define WADI_SSS_BLKSOUTEVT6CFG_OUTEVT6_M   0xFFU   // Output configuration on event 6

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLKSOUTEVT7CFG register
//
//*************************************************************************************************
#define WADI_SSS_BLKSOUTEVT7CFG_OUTEVT7_S   0U
#define WADI_SSS_BLKSOUTEVT7CFG_OUTEVT7_M   0xFFU   // Output configuration on event 7

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_BLKSOUTEVT8CFG register
//
//*************************************************************************************************
#define WADI_SSS_BLKSOUTEVT8CFG_OUTEVT8_S   0U
#define WADI_SSS_BLKSOUTEVT8CFG_OUTEVT8_M   0xFFU   // Output configuration on event 8

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT5TRIGCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT5TRIGCFG_EVT1TRIG   0x1U    // Sets OUTEVT5 based on Event 1 Trigger
#define WADI_SSS_OUTEVT5TRIGCFG_EVT2TRIG   0x2U    // Sets OUTEVT5 based on Event 2 Trigger
#define WADI_SSS_OUTEVT5TRIGCFG_EVT3TRIG   0x4U    // Sets OUTEVT5 based on Event 3 Trigger
#define WADI_SSS_OUTEVT5TRIGCFG_EVT4TRIG   0x8U    // Sets OUTEVT5 based on Event 4 Trigger
#define WADI_SSS_OUTEVT5TRIGCFG_EVT5TRIG   0x10U   // Sets OUTEVT5 based on Event 5 Trigger
#define WADI_SSS_OUTEVT5TRIGCFG_EVT6TRIG   0x20U   // Sets OUTEVT5 based on Event 6 Trigger
#define WADI_SSS_OUTEVT5TRIGCFG_EVT7TRIG   0x40U   // Sets OUTEVT5 based on Event 7 Trigger
#define WADI_SSS_OUTEVT5TRIGCFG_EVT8TRIG   0x80U   // Sets OUTEVT5 based on Event 8 Trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT6TRIGCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT6TRIGCFG_EVT1TRIG   0x1U    // Sets OUTEVT6 based on Event 1 Trigger
#define WADI_SSS_OUTEVT6TRIGCFG_EVT2TRIG   0x2U    // Sets OUTEVT6 based on Event 2 Trigger
#define WADI_SSS_OUTEVT6TRIGCFG_EVT3TRIG   0x4U    // Sets OUTEVT6 based on Event 3 Trigger
#define WADI_SSS_OUTEVT6TRIGCFG_EVT4TRIG   0x8U    // Sets OUTEVT6 based on Event 4 Trigger
#define WADI_SSS_OUTEVT6TRIGCFG_EVT5TRIG   0x10U   // Sets OUTEVT6 based on Event 5 Trigger
#define WADI_SSS_OUTEVT6TRIGCFG_EVT6TRIG   0x20U   // Sets OUTEVT6 based on Event 6 Trigger
#define WADI_SSS_OUTEVT6TRIGCFG_EVT7TRIG   0x40U   // Sets OUTEVT6 based on Event 7 Trigger
#define WADI_SSS_OUTEVT6TRIGCFG_EVT8TRIG   0x80U   // Sets OUTEVT6 based on Event 8 Trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT7TRIGCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT7TRIGCFG_EVT1TRIG   0x1U    // Sets OUTEVT7 based on Event 1 Trigger
#define WADI_SSS_OUTEVT7TRIGCFG_EVT2TRIG   0x2U    // Sets OUTEVT7 based on Event 2 Trigger
#define WADI_SSS_OUTEVT7TRIGCFG_EVT3TRIG   0x4U    // Sets OUTEVT7 based on Event 3 Trigger
#define WADI_SSS_OUTEVT7TRIGCFG_EVT4TRIG   0x8U    // Sets OUTEVT7 based on Event 4 Trigger
#define WADI_SSS_OUTEVT7TRIGCFG_EVT5TRIG   0x10U   // Sets OUTEVT7 based on Event 5 Trigger
#define WADI_SSS_OUTEVT7TRIGCFG_EVT6TRIG   0x20U   // Sets OUTEVT7 based on Event 6 Trigger
#define WADI_SSS_OUTEVT7TRIGCFG_EVT7TRIG   0x40U   // Sets OUTEVT7 based on Event 7 Trigger
#define WADI_SSS_OUTEVT7TRIGCFG_EVT8TRIG   0x80U   // Sets OUTEVT7 based on Event 8 Trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT8TRIGCFG register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT8TRIGCFG_EVT1TRIG   0x1U    // Sets OUTEVT8 based on Event 1 Trigger
#define WADI_SSS_OUTEVT8TRIGCFG_EVT2TRIG   0x2U    // Sets OUTEVT8 based on Event 2 Trigger
#define WADI_SSS_OUTEVT8TRIGCFG_EVT3TRIG   0x4U    // Sets OUTEVT8 based on Event 3 Trigger
#define WADI_SSS_OUTEVT8TRIGCFG_EVT4TRIG   0x8U    // Sets OUTEVT8 based on Event 4 Trigger
#define WADI_SSS_OUTEVT8TRIGCFG_EVT5TRIG   0x10U   // Sets OUTEVT8 based on Event 5 Trigger
#define WADI_SSS_OUTEVT8TRIGCFG_EVT6TRIG   0x20U   // Sets OUTEVT8 based on Event 6 Trigger
#define WADI_SSS_OUTEVT8TRIGCFG_EVT7TRIG   0x40U   // Sets OUTEVT8 based on Event 7 Trigger
#define WADI_SSS_OUTEVT8TRIGCFG_EVT8TRIG   0x80U   // Sets OUTEVT8 based on Event 8 Trigger

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT5DUR register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT5DUR_TIME_S   0U
#define WADI_SSS_OUTEVT5DUR_TIME_M   0xFFFFFFU   // Duration time for application of OUTEVT5

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT6DUR register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT6DUR_TIME_S   0U
#define WADI_SSS_OUTEVT6DUR_TIME_M   0xFFFFFFU   // Duration time for application of OUTEVT6

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT7DUR register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT7DUR_TIME_S   0U
#define WADI_SSS_OUTEVT7DUR_TIME_M   0xFFFFFFU   // Duration time for application of OUTEVT7

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSS_OUTEVT8DUR register
//
//*************************************************************************************************
#define WADI_SSS_OUTEVT8DUR_TIME_S   0U
#define WADI_SSS_OUTEVT8DUR_TIME_M   0xFFFFFFU   // Duration time for application of OUTEVT8

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTEST register
//
//*************************************************************************************************
#define WADI_PARTEST_TESTEN_S   0U
#define WADI_PARTEST_TESTEN_M   0xFU   // Parity test enable configuration



#endif
